Revit 2027 API
ParameterTypeId.RbsPipeInnerDiamParam Property
 "Inside Diameter"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsPipeInnerDiamParam { get; }
Public Shared ReadOnly Property RbsPipeInnerDiamParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsPipeInnerDiamParam {
	ForgeTypeId^ get ();
}
static member RbsPipeInnerDiamParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace